Comp250/midterm-reviewIII.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-20 Sun 11:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Midterm I, Review III: The Real Deal</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Midterm I, Review III: The Real Deal</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7eb76fd">1. Midterm Review III</a>
<ul>
<li><a href="#orgb885215">1.1. Question 1</a></li>
<li><a href="#org917b633">1.2. Question 2</a></li>
<li><a href="#org8b80ca3">1.3. Question 3</a></li>
<li><a href="#orgb5b90d2">1.4. Question 4</a></li>
<li><a href="#orge66658f">1.5. Question 5</a></li>
<li><a href="#org5dc20cb">1.6. Question 6</a></li>
<li><a href="#org60f1879">1.7. Question 7</a></li>
<li><a href="#org95faf9f">1.8. Question 8</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7eb76fd" class="outline-2">
<h2 id="org7eb76fd"><span class="section-number-2">1.</span> Midterm Review III</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb885215" class="outline-3">
<h3 id="orgb885215"><span class="section-number-3">1.1.</span> Question 1</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I said just E, but that&rsquo;s wrong. It was also A, which is a mistake I might not have made if I wasn&rsquo;t reading it on the computer
</p>
</div>
</div>
<div id="outline-container-org917b633" class="outline-3">
<h3 id="org917b633"><span class="section-number-3">1.2.</span> Question 2</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>BOOM</li>
<li>BOOM</li>
<li>DOOM</li>
<li>BOOM</li>
<li>DOOM
Moral of the story, stick with your gut. You don&rsquo;t need to explicitly typecast to a double. Java isn&rsquo;t as retarded as you might think</li>
</ol>
</div>
</div>
<div id="outline-container-org8b80ca3" class="outline-3">
<h3 id="org8b80ca3"><span class="section-number-3">1.3.</span> Question 3</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Dragon d = new Monster ();</li>
<li>Monster bojack = new Monster ();
Dragon dragon = (Dragon) bojack;</li>
<li>Monster bojack = new Dragon();
Zombie walle = (Zombie) bojack;</li>
<li>Monster bojack = new Zombie();
bojack.spook();</li>
<li>Everything except Unicorn and Dragon</li>
<li>Lines 4 and 5 will cause a runtime error. You need to call the Unicorn constructor
<i>again, there was an issue on the 11th line too, read the problem closer</i></li>
<li>7
<i>It&rsquo;s not 7, it&rsquo;s 2. The array initializes the values as 0, which you already knew.</i></li>
<li><p>
The following is my implementation:
</p>
<div class="org-src-container">
<pre class="src src-java">       <span style="color: #fb4934;">public</span> <span style="color: #fabd2f;">void</span> <span style="color: #b8bb26;">encounter</span> <span style="color: #fe8019;">(</span><span style="color: #fabd2f;">Hero</span> <span style="color: #83a598;">x</span><span style="color: #fe8019;">)</span> <span style="color: #fe8019;">{</span>
           <span style="color: #fb4934;">this</span>.spook<span style="color: #b16286;">()</span>; <span style="color: #928374;">//</span><span style="color: #928374;">this was added in after the face. Read the problem closer</span>
           <span style="color: #fb4934;">if</span> <span style="color: #b16286;">(</span>x.engageInFight <span style="color: #b8bb26;">(</span><span style="color: #fb4934;">this</span><span style="color: #b8bb26;">)</span><span style="color: #b16286;">)</span> <span style="color: #b16286;">{</span>
               <span style="color: #fb4934;">this</span>.breatheFire<span style="color: #b8bb26;">()</span>;
               x.retreat<span style="color: #b8bb26;">()</span>;
           <span style="color: #b16286;">}</span>
       <span style="color: #fe8019;">}</span>
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-orgb5b90d2" class="outline-3">
<h3 id="orgb5b90d2"><span class="section-number-3">1.4.</span> Question 4</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Mutable, you can groom the pet and change the fluffiness</li>
<li><p>
Below is my implementation:
</p>

<div class="org-src-container">
<pre class="src src-java">   <span style="color: #fb4934;">super</span><span style="color: #fe8019;">(</span>n, <span style="color: #d3869b; font-weight: bold;">10</span><span style="color: #fe8019;">)</span>;
   <span style="color: #fb4934;">this</span>.groomFactor = gf;
</pre>
</div></li>

<li><p>
Below is my implementation:
</p>
<div class="org-src-container">
<pre class="src src-java">   <span style="color: #d3869b;">@Override</span>
   <span style="color: #fb4934;">public</span> <span style="color: #fabd2f;">void</span> <span style="color: #b8bb26;">groom</span> <span style="color: #fe8019;">()</span> <span style="color: #fe8019;">{</span>
        <span style="color: #fabd2f;">int</span> <span style="color: #83a598;">i</span> = <span style="color: #d3869b; font-weight: bold;">0</span>;
        <span style="color: #fb4934;">while</span> <span style="color: #b16286;">(</span>i &lt; <span style="color: #fb4934;">this</span>.groomFactor<span style="color: #b16286;">)</span> <span style="color: #b16286;">{</span>
                <span style="color: #fb4934;">super</span>.groom<span style="color: #b8bb26;">()</span>;
                i++;
        <span style="color: #b16286;">}</span>
   <span style="color: #fe8019;">}</span>
</pre>
</div></li>

<li>20 + 15 + (10 + 2) 47, 9
<i>focus on the problem, read it very carefully</i></li>

<li>public static Rabbit getMostFamous (Pet[] bunnies);</li>
</ol>
</div>
</div>
<div id="outline-container-orge66658f" class="outline-3">
<h3 id="orge66658f"><span class="section-number-3">1.5.</span> Question 5</h3>
<div class="outline-text-3" id="text-1-5">
<p>
(node.next != null &amp;&amp; node != null)
</p>
</div>
</div>
<div id="outline-container-org5dc20cb" class="outline-3">
<h3 id="org5dc20cb"><span class="section-number-3">1.6.</span> Question 6</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Swaps all elements up to index i in list a
</p>
</div>
</div>
<div id="outline-container-org60f1879" class="outline-3">
<h3 id="org60f1879"><span class="section-number-3">1.7.</span> Question 7</h3>
<div class="outline-text-3" id="text-1-7">
<p>
D
B {E  A{ G } F}
</p>
</div>
</div>
<div id="outline-container-org95faf9f" class="outline-3">
<h3 id="org95faf9f"><span class="section-number-3">1.8.</span> Question 8</h3>
<div class="outline-text-3" id="text-1-8">
<p>
D
</p>
</div>
</div>
</div>
</div>
</body>
</html>
